cmsis-svd/cmsis-svd/data/Fujitsu/MB9AF15xN.xml
        <!-- REGISTER "WTYR" -->
        <register>
          <name>WTYR</name>
          <description>Year Register</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TY" -->
            <field>
              <name>TY</name>
              <description>the second digit of the year</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Y" -->
            <field>
              <name>Y</name>
              <description>the first digit of the year</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTMOR" -->
        <register>
          <name>WTMOR</name>
          <description>Month Register</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMO0" -->
            <field>
              <name>TMO0</name>
              <description>the second digit in the month</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MO" -->
            <field>
              <name>MO</name>
              <description>the first digit of the month</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDW" -->
        <register>
          <name>WTDW</name>
          <description>Day of the Week Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DW" -->
            <field>
              <name>DW</name>
              <description>Day of the week</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALDR" -->
        <register>
          <name>ALDR</name>
          <description>Alarm Date Register</description>
          <addressOffset>0x17</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAD" -->
            <field>
              <name>TAD</name>
              <description>the second digit of the alarm-set date</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD" -->
            <field>
              <name>AD</name>
              <description>the first digit of the alarm-set date</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALHR" -->
        <register>
          <name>ALHR</name>
          <description>Alarm Hour Register</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAH" -->
            <field>
              <name>TAH</name>
              <description>the second digit of the alarm-set hour</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AH" -->
            <field>
              <name>AH</name>
              <description>the first digit of the alarm-set hour</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMIR" -->
        <register>
          <name>ALMIR</name>
          <description>Alarm Minute Register</description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMI" -->
            <field>
              <name>TAMI</name>
              <description>the second digit of the alarm-set minute</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMI" -->
            <field>
              <name>AMI</name>
              <description>the first digit of the alarm-set minute</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALYR" -->
        <register>
          <name>ALYR</name>
          <description>Alarm Years Register</description>
          <addressOffset>0x1A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAY" -->
            <field>
              <name>TAY</name>
              <description>the second digit of the alarm-set year</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AY" -->
            <field>
              <name>AY</name>
              <description>the first digit of the alarm-set year</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMOR" -->
        <register>
          <name>ALMOR</name>
          <description>Alarm Month Register</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMO0" -->
            <field>
              <name>TAMO0</name>
              <description>the second digit of the alarm-set month</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMO" -->
            <field>
              <name>AMO</name>
              <description>the first digit of the alarm-set month</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
